<template>
  <Layout>

  <div class="Strasburg">
    <div class="banner">
      <div class="title">
        <h1>{{ title }}</h1>
        <span>published on {{ date }}</span>
      </div>
    </div>

    <main>
      <video
        src="..\assets\misomania\banner.mp4"
        type="video/mp4"
        controls
      ></video>
      <div class="content" v-for="sections in content" :key="sections.text">
        <p>{{ sections.text }}</p>
        <div class="content__image">
          <img :src="sections.image" alt="" />
        </div>
      </div>
    </main>
  </div>
    </Layout>

</template>

<script>
import Layout from "~/layouts/Default.vue";

export default {
  name: "Strasburg",
    components: {

    Layout
  },
  data() {
    return {
      title: "Untitled Strasburg",
      date: "30.05.2018",
      content: [
        {
          text:
            "Тучи, гонимые ветряными мельницами, темнели. Звук пролетающих мимо фонарей терялся в порывах предштормового вихря. Последний отблеск солнца исчез за горизонтом, но на тысячную секунды небо озарилось вновь. Гроза.",
          image: require("@/assets/misomania/UntitledStraßburgImages/1.jpg"),
        },
        {
          text:
            "Неоновый свет, разбиваясь о капли дождя обрушивался разноцветными проблесками на лобовое стекло и исчезал раз за разом где-то позади. Поля сменялись городами, скорость же смывала всё в цветные ленты. Перечеркнув всё, в дали, подпирая небо, незыблемо высился световой столб, храм мёртвых богов. Ночь.",
          image: require("@/assets/misomania/UntitledStraßburgImages/2.jpg"),
        },
        {
          text:
            "Ливень барабанивший по окнам разбудил нас. Зонт скрывал город шорами, глядя на булыжную мостовую мы брели по городу к главной достопримечательности.",
          image: require("@/assets/misomania/UntitledStraßburgImages/3.jpg"),
        },
        {
          text:
            "Собор! Он подпирал собою низкое свинцовое небо, не давая ему падать дальше. Он рвал материю облаков своим красноватым камнем и из небесных дыр хлестала вода.",
          image: require("@/assets/misomania/UntitledStraßburgImages/4.jpeg"),
        },
        {
          text:
            "Святые и грешники, короли и иереи, драконы и собаки омывались в воде и исчезали где-то там, наверху, откуда звон колокола еле доходил до нас, здесь, внизу смотрящих.",
          image: require("@/assets/misomania/UntitledStraßburgImages/5.jpg"),
        },
        {
          text:
            "Современная наука учит нас, о запутанности света, телепортации состояния и о том, что чем больше смотришь на солнце,тем больше оно смотрит на тебя тем быстрее оно распадётся. Знания эти известны, описаны и изучены. Но есть что-то, что потерянно, что не могут описать квантовые физики, не могут воссоздать зодчие мета-модернисты. Знания создания объёмов бóльших внутри, чем снаружи. Они потеряны или забыты и неподготовленный зритель, при виде такого каменного престедижитаторства, впадает в ступор, пытаясь понять где скрывается обман. Но обмана нет.",
          image: require("@/assets/misomania/UntitledStraßburgImages/6.jpg"),
        },
        {
          text:
            "Стёкла витражей озаряли своды храма красными, зелёными, синими бликами. Строгие взоры Германских королей взирали на прихожан.",
          image: require("@/assets/misomania/UntitledStraßburgImages/7.jpg"),
        },
        {
          text:
            "Отблески уличной суеты отражались в глазах Отто и Фридриха Барбароссы (Fredericus imperator submersus — подводный, император погиб, упав в речку Селиф), создавая иллюзию неразрывности истории от Константина до нас, взирающих.",
          image: require("@/assets/misomania/UntitledStraßburgImages/8.jpg"),
        },
        {
          text:
            "Пройдя с интересом первый ярус галереи, северного нефа, я понял, что у Анны есть предел интереса к зодчеству и истории. Запал в очах, начинал сливаться со взглядами уставших зевак, окружавших её, пообещав скорый уход, хлеб, воду и все нереализуемые блага и посадив её лицом к алтарю, я двинулся дальше, откуда на нас взирали благочестивые лица рыцарей.",
          image: require("@/assets/misomania/UntitledStraßburgImages/9.jpg"),
        },
        {
          text:
            "Очнулся, когда часы ударили пять раз и взяв под мышку своего терпеливого партнёры побежал.",
          image: require("@/assets/misomania/UntitledStraßburgImages/10.jpg"),
        },
        {
          text:
            "Мы бежали сквозь узкие улочки, расталкивая туристов, мимо мелькали фахверковые домики, отражение часовни в воде блистало проснувшимся солнцем. ",
          image: require("@/assets/misomania/UntitledStraßburgImages/11.jpg"),
        },
        {
          text:
            "Мы бежали туда, где под сенью четырёхсотлетнего дуба у зноя канала, нас ждало наше маленькое Бельгийское подкрепление.",
          image: require("@/assets/misomania/UntitledStraßburgImages/12.jpg"),
        },
        {
          text: "И был вечер и были разговоры, и звонкий, яркий смех.",
          image: require("@/assets/misomania/UntitledStraßburgImages/13.jpg"),
        },
        {
          text:
            "Когда-то очень давно, когда дубы были выше, трава зеленее, а тумаки крепче, на порогах реки Иль строили водяные мельницы, мельники, а рыбаки и кожевники постраивали свои мастерские. Всё это веяло благовониями, турнирами и размеренной средневековой жизнью, где рыцари доблестны, купцы честны, а чернь предана. Среди нерасторопного острова образовалась лечебница, занимавшаяся по существу болезнями греховоднического порядка. Болезнь же любовно называли французской, откуда и пошло название острова. Маленькая Франция.",
          image: require("@/assets/misomania/UntitledStraßburgImages/14.jpg"),
        },
        {
          text:
            "Оставив одну четверть нашего отряда арьергардом в отеле, работать, мы шли, насвистывая по узким улицам острова. Близился час туриста, и мы благовенно чеканили шаг.",

          image: require("@/assets/misomania/UntitledStraßburgImages/15.jpg"),
        },
        {
          text:
            "Мы шли по улицам, где когда-то Гуттенберг бегал в винный погребок, где не утихали распри Реформации, где в одном из салонов, в закоулках улиц, де Лиль впервые исполнял Марсельезу.",
          image: require("@/assets/misomania/UntitledStraßburgImages/16.jpg"),
        },
        {
          text:
            "Мы брели по освещённым весенним солнцем проулкам по городу, стоящему в центре Европейской истории. Шаги отлетали от мостовой и разбивались о ветхие, согбенные под грузом веков дома, ведущий род свой от хижин алеманов, сожжённых гуннами и отстроенных заново франками. История Европы отлетала эхом от этих стен и дробилась как наши шаги. Раздоры забытых франкских братьев, приводили к войнам и победам. Страсбург же был чашей Грааля для великих мёртвых героев.",

          image: require("@/assets/misomania/UntitledStraßburgImages/17.jpg"),
        },
        {
          text:
            "Умотав батальон своими оханьями и аханьями, тыканьями пальцев в камни, был произведён мятеж, с меня были сняты погоны и командование и как последние пираты, компаньоны, подняв весёлого Роджера, двинули в винный погребок.",

          image: require("@/assets/misomania/UntitledStraßburgImages/18.jpg"),
        },
        {
          text:
            "Вечер спускался на город. Дневная жара сменялась вечерним зноем, а лёгкая томность дня на острый вечерний голод. Воссоединив силы с нашим рабочим арьергардом, в лице товарища Усачёвой, был задан путь на интернациональную кухню, и мы обещали нести.Товарищ Шепелева, взявши красное знамя, неутомимо вела нас к заветной пище. Обещан был хумус, лаваш и манна небесная.",

          image: require("@/assets/misomania/UntitledStraßburgImages/19.jpg"),
        },
        {
          text:
            "Со сменой пейзажа, менялось и общее отношение к товарищу Шепелевой. Голод делал свои метаморфозы и товарищ Анка, постепенно превращалась в товарища Сусанина, ведущего нас как бедных ляхов в болото. Пейзажи обещали всё более и более интернациональную еду. Веяло чайханами, кальянами и ненароком пробегающим верблюдом. Моё замечание про заветный французский модернизм шестидесятых и что не всё так плохо, и вроде бы вообще чисто, был воспринят в штыки и в глазах боевых товарищей я видел что если что, первым будут есть меня. Мы очутились в медине французских блочных домов (Голль-щёбы?). Пик контраста бетона и восточных традиций. Отведав яств Леванта, мы решили, что сказка всё-таки не тысяча и одна ночь и вернулись к старым добрым домикам братьев Гримм.",

          image: require("@/assets/misomania/UntitledStraßburgImages/20.jpg"),
        },
        {
          text:
            "Покачиваясь на волнах реки, среди толпы туристов, Морфей наводил на нас свои чары, было решено что с городом покончено, хочется свободы, ветра и тёмного леса. Лучше гор могут быть только горы, На которых ещё не бывал. Мы бежали вверх, всё выше и выше, к орлам и голубому небу. Горы обступали и обволакивали нас каменными туннелями. Мы вылетали стрелой и стремились всё выше. К заветному озеру, созданному для нас. Созданному давно, но именно для нас.",
          image: require("@/assets/misomania/UntitledStraßburgImages/21.jpg"),
        },
        {
          text:
            "Тишина. Звенящая тишина. Только волны бились о киль нашего корабля. И снова звон смеха и снова разговоры и все мы капитаны и все мы юнги на этой огромной, педальной шхуне.",

          image: require("@/assets/misomania/UntitledStraßburgImages/22.jpg"),
        },
        {
          text:
            "Над чем же мы могли смеяться в этой блаженной пустоте? Мысль о названии озера, предавало совершенно другой смысл волнам бьющимся о нашу лодку. Тити-зее. Озеро тить. Тити журчали и бились, тити блестели на солнце. И это наводило улыбку десятилетнего, нашкодившего мальчика.",

          image: require("@/assets/misomania/UntitledStraßburgImages/23.jpg"),
        },
      ],
    };
  },
};
</script>

<style lang="scss" scoped>
@mixin flexCenter($direction) {
  display: flex;
  flex-direction: $direction;
  justify-content: center;
  align-content: center;
}
.Strasburg {
  .banner {
    @include flexCenter(column);
    max-width: 1200px;
    // height: 50vh;
    // background-color: black;
      margin: auto;

    .title {
      @include flexCenter(row);
      height: 300px;
      position: relative;
      h1 {
        font-size: 4rem;
        margin: auto;
        display: flex;
        color: black;
        flex: 1;
        &::after {
          content: "";
          height: 3px;
          width: 50%;
          background-color: black;
          // position: absolute;
          // left: 30%;
          // top: 50%;
          margin: auto;
        }
      }
      span{
        position: relative;
        top:7.5rem;
        right:10rem;
      }
    }
  }
  main {
    @include flexCenter(column);
    max-width: 1000px;

    margin: auto;
    video {
      outline: none;
      border-top: 7px solid black;
      width: 100%;
      margin: 0 auto 2rem;
    }
    .content {
      width: 100%;
      margin: auto;
      &__image {
        margin: 0 auto 2rem;
        img {
          width: 100%;
        }
      }
      p {
        margin: 0 auto 2rem;
        line-height: 1.6;
        font-size: 1.2rem;
      }
    }
  }
}
</style>
